app/Http/Controllers/Auth_controller.php

insert into "users" ("first_name", "last_name", "email", "password", "question_recuperation", "response_recuperation", "birthday", "updated_at", "created_at") values ('rr', 'rr', 'r@r.r', '$2y$12$aMVZ6YswSvAIY56lbRtvBezdg9X3dDBawt.uXoXEwOYnM7XSm/ozK', 'question', 'response', '0002-02-02', '2024-05-02 14:33:20', '2024-05-02 14:33:20') returning "id"
---
    public function handling_register()
    {
        // check if inputs are correctly filled
        request()->validate([
        'first_name' => ['required'],
        'last_name' => ['required'],
        'birth_date' => ['required'],
        'email' => ['required', 'email', 'unique:users,email'],
        'password' => ['required', 'min:2'],
        ]);
        // create new user
        user::create([
        'first_name' => request('first_name'),
        'last_name' => request('last_name'),
        'email' => request('email'),
        'password' => bcrypt(request('password')),
        'question_recuperation' => 'question',
        'response_recuperation' => 'response',
        'birthday' => request('birth_date'),
        ]);