app/Http/Controllers/mailbox_controller.php

select exists(select * from "categories" where "categories"."user_id" = 1 and "categories"."user_id" is not null and "native" = 1) as "exists"
---
    public function form_draft()
    {
        $user = auth()->user(); // collect connected user
        if (!$user->categories()->where('native', true)->exists()) {

select exists(select * from "categories" where "categories"."user_id" = 1 and "categories"."user_id" is not null and "native" = 1) as "exists"
---
    public function form_spam()
    {
        $user = auth()->user(); // collect connected user
        if (!$user->categories()->where('native', true)->exists()) {

select exists(select * from "categories" where "categories"."user_id" = 1 and "categories"."user_id" is not null and "native" = 1) as "exists"
---
    public function form_all()
    {
        $user = auth()->user(); // collect connected user
        if (!$user->categories()->where('native', true)->exists()) {