app/Http/Controllers/mailbox_controller.php

insert into "categories" ("name", "native", "user_id", "updated_at", "created_at") values ('inbox', 1, 1, '2024-05-03 09:26:51', '2024-05-03 09:26:51') returning "id"
select * from "categories" where "name" = 'inbox' limit 1
insert into "emails" ("sender_user_id", "receiver_user_id", "object", "content", "sent_at", "starred", "category_id", "updated_at", "created_at") values (1, 1, 'Abonnement', 'votre compte est...', '2024-05-03 09:26:51', 0, 1, '2024-05-03 09:26:51', '2024-05-03 09:26:51') returning "id"
---
    public function fill_native_categories(User $user)
    {
        $categories = [
            'inbox',
            'draft',
            'sent',
            'starred',
            'archive',
            'spam',
            'trash',
            'all_mail',
        ];

        foreach ($categories as $category) {
            $user->categories()->create([
                'name' => $category,
                'native' => true,
            ]);
        }
        // cette partie sera à supprimer
        $category = Category::where('name', 'inbox')->first(); // Assuming emails should be created in the inbox category

        for ($i = 1; $i <= 3; $i++){
            $category->emails()->create([
                'sender_user_id' => 1,
                'receiver_user_id' => $user->id,
                'cc_user_id',
                'bcc_user_id',
                'object' => 'Abonnement',
                'content' => 'votre compte est...',
                'sent_at' => now(),
                'starred' => false,
                'attachment',
            ]);

select exists(select * from "categories" where "categories"."user_id" = 1 and "categories"."user_id" is not null and "native" = 1) as "exists"
select * from "categories" where "name" = 'inbox' limit 1
select * from "emails" where "category_id" = 1
---
    public function form_inbox()
    {
        $user = auth()->user(); // collect connected user
        if (!$user->categories()->where('native', true)->exists()) {
            $this->fill_native_categories($user);
        }
        $inbox_category = Category::where('name', 'inbox')->first();
        if ($inbox_category) {
            $inbox_emails = Email::where('category_id', $inbox_category->id)->get();

select exists(select * from "categories" where "categories"."user_id" = 1 and "categories"."user_id" is not null and "native" = 1) as "exists"
select * from "categories" where "name" = 'starred' limit 1
select * from "emails" where "category_id" = 4
---
    public function form_starred()
    {
        $user = auth()->user(); // collect connected user
        if (!$user->categories()->where('native', true)->exists()) {
            $this->fill_native_categories($user);
        }
        $starred_category = Category::where('name', 'starred')->first();
        if ($starred_category) {
            $starred_emails = Email::where('category_id', $starred_category->id)->get();

select exists(select * from "categories" where "categories"."user_id" = 1 and "categories"."user_id" is not null and "native" = 1) as "exists"
select * from "categories" where "name" = 'archive' limit 1
select * from "emails" where "category_id" = 5
---
    public function form_archive()
    {
        $user = auth()->user(); // collect connected user
        if (!$user->categories()->where('native', true)->exists()) {
            $this->fill_native_categories($user);
        }
        $archive_category = Category::where('name', 'archive')->first();
        if ($archive_category) {
            $archive_emails = Email::where('category_id', $archive_category->id)->get();

select exists(select * from "categories" where "categories"."user_id" = 1 and "categories"."user_id" is not null and "native" = 1) as "exists"
select * from "categories" where "name" = 'trash' limit 1
select * from "emails" where "category_id" = 7
---
    public function form_trash()
    {
        $user = auth()->user(); // collect connected user
        if (!$user->categories()->where('native', true)->exists()) {
            $this->fill_native_categories($user);
        }
        $trash_category = Category::where('name', 'trash')->first();
        if ($trash_category) {
            $trash_emails = Email::where('category_id', $trash_category->id)->get();

select * from "categories" where "name" = 'starred' limit 1
select * from "emails" where "category_id" = 4
update "emails" set "category_id" = 4, "updated_at" = '2024-05-03 13:58:30' where "id" = '6'
---
    public function add_to_starred()
    {
        $email_id = request()->input('email_id'); // collect email id
        $category = Category::where('name', 'starred')->first(); // collect starred category
        Email::where('id', $email_id)->update(['category_id' => $category->id]); // update email category to starred

select * from "categories" where "name" = 'archive' limit 1
select * from "emails" where "category_id" = 4
update "emails" set "category_id" = 5, "updated_at" = '2024-05-03 13:58:36' where "id" = '6'
---
    public function add_to_archive()
    {
        $email_id = request()->input('email_id'); // collect email id
        $category = Category::where('name', 'archive')->first(); // collect starred category
        Email::where('id', $email_id)->update(['category_id' => $category->id]); // update email category to archive

select * from "categories" where "name" = 'trash' limit 1
select * from "emails" where "category_id" = 5
update "emails" set "category_id" = 7, "updated_at" = '2024-05-03 13:58:42' where "id" = '6'
---
    public function add_to_trash()
    {
        $email_id = request()->input('email_id'); // collect email id
        $category = Category::where('name', 'trash')->first(); // collect starred category
        Email::where('id', $email_id)->update(['category_id' => $category->id]); // update email category to trash

select * from "categories" where "name" = 'inbox' limit 1
select * from "emails" where "category_id" = 7
update "emails" set "category_id" = 1, "updated_at" = '2024-05-03 13:57:09' where "id" = '6'
---
    public function remove_from_trash()
    {
        $email_id = request()->input('email_id'); // collect email id
        $category = Category::where('name', 'inbox')->first(); // collect inbox category
        Email::where('id', $email_id)->update(['category_id' => $category->id]); // update email starred to inbox

delete from "emails" where "id" = '3'
---
    public function delete_email()
    {
        $email_id = request()->input('email_id'); // collect email id
        Email::where('id', $email_id)->delete(); // delete email